Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.СписокРеализаций.Очистить(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период формирования документов.");
		
		Возврат;
		
	КонецЕсли;
	
	ДлительнаяОперация = НачатьВыполнениеНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = "Формирование актов...";
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);  

	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьВыполнениеНаСервере()
	
	НаименованиеЗадания = НСтр("ru = 'Формирование актов'");
	ИмяФункции = "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокНаСервере";
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", Объект.Период);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = ИмяФункции;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяФункции,ПараметрыПроцедуры);
		

//	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
//	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокНаСервере", 
//	Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
	
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			Возврат;
			
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
			ОбщегоНазначенияКлиент.СообщитьПользователю("Формирование документов реализации выполнено успешно");
			ЗаполнитьСписокРеализаций(Результат.АдресРезультата);
						
	КонецЕсли;
	
КонецПроцедуры 
 
&НаКлиенте
Процедура  ЗаполнитьСписокРеализаций(АдресХранилища);
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	СсылкаНаДокумент = Результат;

	Объект.СписокРеализаций.Очистить(); 
	
	Для Каждого Строка Из СсылкаНаДокумент Цикл
		 
		НоваяСтрока = Объект.СписокРеализаций.Добавить();
		НоваяСтрока.Договор = Строка.Договор;
		НоваяСтрока.Реализация = Строка.Реализация;

		Если Строка.Реализация = Неопределено Тогда
			
		    ТекстСообщения = СтрШаблон("По договору ""%1"" не удалось создать документ. Подробности в журнале регистрации.", НоваяСтрока.Договор);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
